import java.util.Arrays;
import java.lang.Math;



public class HelloWorld {
    public static void main(String[] argt) {
      /*  System.out.println("Hello world");
        boolean tert = true;
        System.out.println(tert);

        float r = 3.14f;
        double t = 3.14;
        System.out.println(r);
        System.out.println(t);

        char a = 'c';
        System.out.println(a);

        //----- ??????????????? ? ?????? ???? ? ??????
        double d = 0.6;
        int i = 5;
        d = (double) i;  //? ????? ??????. ?????? ????. ????. double
        System.out.println("    " + d + "   ");
        //-----

        try {
            Byte b1 = new Byte("10");
            System.out.println(b1);
        } catch (NumberFormatException e) {
            System.err.println("???????? ?????? ??????!");
        }

        String str1 = "111";
        try {
            Byte b2 = Byte.valueOf(str1);
            System.out.println(b2);
        } catch (NumberFormatException e) {
            System.err.println("???????? ?????? ??????!");
        }

        System.out.println(9.0 / 2);*/


    /*??????


       /*===========================================*/
        /*===========================================*/

        /*================================ Второй урок============*/


        System.out.println("\t \t Урок Второй \n Задание №1 \n Результат деления q на w с остатком \n");
        System.out.print("Ответ: ");

        Lessen1.oneTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Второй \n Задание №2 \n Вычисисление суммы цифр числа \n");
        System.out.print("Ответ: ");

        Lessen1.twoTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Второй \n Задание №3 \n Округление числа до ближайшего целого \n");
        System.out.print("Ответ: ");

        Lessen1.threeTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Второй \n Задание №4 \n Вычисисление суммы цифр числа \n");
        System.out.print("Ответ: ");

        Lessen1.fourTask();

        System.out.println("=================================================");
        System.out.println();
        System.out.println("=================================================");
        System.out.println();



        /*===========================================*/
        /*===========================================*/

        /*================================ Третий урок============*/


        System.out.println("\t \t Урок Третий \n Задание №1 \n Проверка, является ли целое число четным или нечетным\n");
        System.out.print("Ответ: ");

        Lesson3.oneTask();

        System.out.println("=================================================");
        System.out.println();


         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №2 \n Определение ближайшего к 10 из двух чисел\n");
        System.out.print("Ответ: ");

        Lesson3.twoTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №3 \n Нахождение вещественного корня квадратного уравнения ax^2+bx + c = 0, либо сообщать, что корней нет. \n");
        System.out.print("Ответ: ");

        Lesson3.threeTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №4 \n Создать программу, которая будет проверять попало ли случайно выбранное из отрезка[ 5;155]целое число\n" +
                "        в интервал (25; 100)и сообщать результат на экран. \n");
        System.out.print("Ответ: ");

        Lesson3.fourTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №5 \n Определение ближайшего к 10 из двух чисел\n");
        System.out.print("Ответ: ");

        //Lesson3.oneTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №6 \n  В городе N проезд в трамвае осуществляется по бумажным отрывным билетам. Каждую неделю трамвайное\n" +
                "        депо заказывает в местной типографии рулон билетов с номерами от 000001 до 999999. «Счастливым» считается\n" +
                "        билетик у которого сумма первых трёх цифр номера равна сумме последних трёх цифр, как, например, в билетах\n" +
                "        с номерами 003102 или 567576. Трамвайное депо решило подарить сувенир обладателю каждого счастливого билета\n" +
                "        и теперь раздумывает, как много сувениров потребуется. С помощью программы подсчитайте сколько счастливых\n" +
                "        билетов в одном рулоне?\n");
        System.out.print("Ответ: ");

        Lesson3.sixTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №7 \n Электронные часы показывают время в формате от 00:00 до 23:59. Подсчитать\n" +
                "        сколько раз за сутки случается так, что слева от двоеточия показывается симметричная\n" +
                "        комбинация для той, что справа от двоеточия\n");
        System.out.print("Ответ: ");

        Lesson3.sevenTask();

        System.out.println("=================================================");
        System.out.println();





        /*===========================================*/
        /*===========================================*/


        /*================================ Чевертый урок============*/


    /*

        int[][]r = new int[][]{{1,2,33},
                            {5,6,88}};// создание двумерного массива

        System.out.println("macciv - " + r.length);


// создать массив и проинициализировать

        // для одномерного массива
        int[]a5 = new int[] {5,55,1,6};
        System.out.println(Arrays.toString(a5));// метод 'Arrays.toString' выводит весь массив на экран


       *//* O(n)
        O(log(n)) сложный
                *//*

        *//*public static int factorial(int n) {
            if(n==0)
                return 1;

            return int d6 = n * factorial(n-1);
            System.out.println();
        }
*/


    }
}