import java.io.IOException;

public class HelloWorld {
    public static void main(String[] argt) throws IOException {
      /*  System.out.println("Hello world");
        boolean tert = true;
        System.out.println(tert);

        float r = 3.14f;
        double t = 3.14;
        System.out.println(r);
        System.out.println(t);

        char a = 'c';
        System.out.println(a);

        //----- ??????????????? ? ?????? ???? ? ??????
        double d = 0.6;
        int i = 5;
        d = (double) i;  //? ????? ??????. ?????? ????. ????. double
        System.out.println("    " + d + "   ");
        //-----

        try {
            Byte b1 = new Byte("10");
            System.out.println(b1);
        } catch (NumberFormatException e) {
            System.err.println("???????? ?????? ??????!");
        }

        String str1 = "111";
        try {
            Byte b2 = Byte.valueOf(str1);
            System.out.println(b2);
        } catch (NumberFormatException e) {
            System.err.println("???????? ?????? ??????!");
        }

        System.out.println(9.0 / 2);*/


    /*??????


       /*===========================================*/
        /*===========================================*/

        /*================================ Второй урок============*/


        System.out.println("\t \t Урок Второй \n Задание №1 \n Результат деления q на w с остатком \n");
        System.out.print("Ответ: ");

        Lessen1.oneTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Второй \n Задание №2 \n Вычисисление суммы цифр числа \n");
        System.out.print("Ответ: ");

        Lessen1.twoTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Второй \n Задание №3 \n Округление числа до ближайшего целого \n");
        System.out.print("Ответ: ");

        Lessen1.threeTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Второй \n Задание №4 \n Вычисисление суммы цифр числа \n");
        System.out.print("Ответ: ");

        Lessen1.fourTask();

        System.out.println("=================================================");
        System.out.println();
        System.out.println("=================================================");
        System.out.println();



        /*===========================================*/
        /*===========================================*/

        /*================================ Третий урок============*/


        System.out.println("\t \t Урок Третий \n Задание №1 \n Проверка, является ли целое число четным или нечетным\n");
        System.out.print("Ответ: ");

        Lesson3.oneTask();

        System.out.println("=================================================");
        System.out.println();


         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №2 \n Определение ближайшего к 10 из двух чисел\n");
        System.out.print("Ответ: ");

        Lesson3.twoTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №3 \n Нахождение вещественного корня квадратного уравнения ax^2+bx + c = 0, либо сообщать, что корней нет. \n");
        System.out.print("Ответ: ");

        Lesson3.threeTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №4 \n Создать программу, которая будет проверять попало ли случайно выбранное из отрезка[ 5;155]целое число\n" +
                "        в интервал (25; 100)и сообщать результат на экран. \n");
        System.out.print("Ответ: ");

        Lesson3.fourTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №5 \n Определение ближайшего к 10 из двух чисел\n");
        System.out.print("Ответ: ");

        //Lesson3.oneTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №6 \n  В городе N проезд в трамвае осуществляется по бумажным отрывным билетам. Каждую неделю трамвайное\n" +
                "        депо заказывает в местной типографии рулон билетов с номерами от 000001 до 999999. «Счастливым» считается\n" +
                "        билетик у которого сумма первых трёх цифр номера равна сумме последних трёх цифр, как, например, в билетах\n" +
                "        с номерами 003102 или 567576. Трамвайное депо решило подарить сувенир обладателю каждого счастливого билета\n" +
                "        и теперь раздумывает, как много сувениров потребуется. С помощью программы подсчитайте сколько счастливых\n" +
                "        билетов в одном рулоне?\n");
        System.out.print("Ответ: ");

        Lesson3.sixTask();

        System.out.println("=================================================");
        System.out.println();

         /*===========================================*/

        System.out.println("\t \t Урок Третий \n Задание №7 \n Электронные часы показывают время в формате от 00:00 до 23:59. Подсчитать\n" +
                "        сколько раз за сутки случается так, что слева от двоеточия показывается симметричная\n" +
                "        комбинация для той, что справа от двоеточия\n");
        System.out.print("Ответ: ");

        Lesson3.sevenTask();

        System.out.println("=================================================");
        System.out.println();





        /*===========================================*/
        /*===========================================*/


        /*================================ Чевертый урок============*/


    /*

        int[][]r = new int[][]{{1,2,33},
                            {5,6,88}};// создание двумерного массива

        System.out.println("macciv - " + r.length);


// создать массив и проинициализировать

        // для одномерного массива
        int[]a5 = new int[] {5,55,1,6};
        System.out.println(Arrays.toString(a5));// метод 'Arrays.toString' выводит весь массив на экран


       *//* O(n)
        O(log(n)) сложный
                *//*

        *//*public static int factorial(int n) {
            if(n==0)
                return 1;

            return int d6 = n * factorial(n-1);
            System.out.println();
        }
*/

        System.out.println("\t \t Урок Четвертый \n Задание №1 \n Создайте массив из всех нечётных чисел от 1 до 99, выведите его на экран в строку, " +
                "\n а затем этот же массив выведите на экран тоже в строку, но в обратном порядке (99 97 95 93 … 7 5 3 1). \n");
        System.out.print("Ответ: ");

        Lesson4.oneTask();

        System.out.println("=================================================");
        System.out.println();

             /*===========================================*/

        System.out.println("\t \t Урок Четвертый \n Задание №2 \n  2. Создайте массив из 15 случайных целых чисел из" +
                "отрезка [0;9]. Выведите массив на экран. Подсчитайте сколько в массиве чётных элементов и выведете это" +
                "количество на экран на отдельной строке.");

        System.out.print("Ответ: ");


        Lesson4.twoTask();

        System.out.println("=================================================");
        System.out.println();

        /*===========================================*/

        System.out.println("\t \t Урок Четвертый \n Задание №3 \n 3. Для проверки остаточных знаний учеников после летних каникул, учитель младших классов решил начинать каждый урок с того,\n" +
                "        чтобы задавать каждому ученику пример из таблицы умножения, но в классе 15 человек, а примеры среди них не должны\n" +
                "        повторяться. В помощь учителю напишите программу, которая будет выводить на экран 15 примеров из таблицы умножения (от 2*2\n" +
                "        до 9*9, потому что задания по умножению на 1 и на 10 — слишком просты). При этом среди 15 примеров не должно быть\n" +
                "        повторяющихся (примеры 2*3 и 3*2 и им подобные пары считать повторяющимися).\n");


        System.out.println("Ответ: ");

        Lesson4.threeTask();

        System.out.println("=================================================");
        System.out.println();


        /*===========================================*/


        System.out.println("\t \t Урок Четвертый \n Задание № 4 \n  4. Создать двумерный массив из 6 строк по 7 столбцов в каждой из случайных целых чисел из отрезка [0;9].\n" +
                "        Вывести массив на экран.\n" +
                "        Преобразовать массив таким образом, чтобы на первом месте в каждой строке стоял её наибольший элемент. При этом изменять\n" +
                "        состав массива нельзя, а можно только переставлять элементы в рамках одной строки. Порядок остальных элементов строки не\n" +
                "        важен (т.е. можно соврешить только одну перестановку, а можно отсортировать по убыванию каждую строку). Вывести\n" +
                "        преобразованный массив на экран.\n");


        System.out.println("Ответ: ");

        //Lesson4.fourTask();

        System.out.println("=================================================");
        System.out.println();



        /*===========================================*/


        System.out.println("\t \t Урок Четвертый \n Задание № 5 \n  5. Выясните экспериментальном путём, начиная с какого элемента последовательности Фибоначчи, вычисление с использованием\n" +
                "        рекурсии становится неприемлемым (занимает более минуты по времени).(Использовать для замера времени System.\n" +
                "        currentTimeMillis() который возвращает время в миллисекундах)\n");


        System.out.println("Ответ: ");

        Lesson4.fiveTask();

        System.out.println("=================================================");
        System.out.println();


     /*===========================================*/


        System.out.println("\t \t Урок Четвертый \n Задание № 6 \n  6. Создайте в классе Circle метод, вычисляющий длину окружности.\n");


        System.out.println("Ответ: ");

        Lesson4.sixTask();

        System.out.println("=================================================");
        System.out.println();


    /*===========================================*/


        System.out.println("\t \t Урок Четвертый \n Задание № 7 \n 7. Создайте в классе Circle метод, перемещающий центр круга в случайную точку квадрата координатной плоскости с\n" +
                "        диагональю от [-99;-99] до [99;99]. Обратите внимание на то, что требуется создать обычный метод, применимый к\n" +
                "        уже существующему объекту, а не конструктор создающий новый объект. \n");


        System.out.println("Ответ: ");

        Lesson4.sevenTask();

        System.out.println("=================================================");
        System.out.println();



/*===========================================*/


        System.out.println("\t \t Урок Четвертый \n Задание № 8 \n 8. Измените в классе Circle конструктор по умолчанию так, чтобы в момент создания объекта с его помощью,\n" +
                "        координаты центра и радиус окружности пользователь вводил с клавиатуры.\n");


        System.out.println("Ответ: ");

        Lesson4.eightTask();

        System.out.println("=================================================");
        System.out.println();




    }


}
    /*========== 03-08-2016=============*/

   // для сравнения объектов используют equals,  для сравнения значений простых типов ислользуют "=="

   //  создание клона происходит клонирование свойств, а не значения.
    /*clone (){
        Point p = new Point();
        p.x = 0;
        p.y = 0;
        return p;
    }*/

       // .toString(); ссылка на объект

    /*========== GET and SET============*/

   /* class Circle {
        private int r;

        public int getRadius() {
            return r;
        }

        public void setRadius(int r) {

       this.r=r+5;

            }
    }
    c1.Rarius = 5;
    c1.setRadius(5);



    extends - унаследование
    implements - ревлизовать

    //Абстрактные классы

    public abstract class Jena{
        public abstract int deposit(int a){

        }
    }
    // создание нового класса наследник от class Jena

    public class Vasa extends Jena{
        public int deposit(int b){

        }
    }

    //Интерфейсы

    public interface Roma{

        public void voice();

        public static final PI = 3.14;// установление констант




    }

    */



